#encoding: utf-8
# кривошипно-шатунний механізм
# статика - визначення полодження повзуна за координатою x кривошипа

import matplotlib.pyplot as plt
from scipy.optimize import root

def f(X): # векторна функція
    L1,L2=1,2 # відомі
    x1,y1,x2,y2=X # невідомі
    eqs=[] # список лівих частин eq рівнянь eq=0
    
    eqs+= [x1-0.5] # обмеження кривошипа x1=0.5
    eqs+= [x1**2 + y1**2 - L1**2]  # незмінна довжина L кривошипа dx**2+dy**2=L**2
    eqs+= [(x2-x1)**2 + (y2-y1)**2 - L2**2] # незмінна довжина L шатуна dx**2+dy**2=L**2
    eqs+= [y2]  # обмеження повзуна y2=0
    return eqs

# Розв'язати систему рівнянь
sol = root(f, [0, 0, 0, 0], method='lm') # Алгоритм Левенберга — Марквардта
x1,y1,x2,y2=sol.x # корені
# нарисувати положення ланок механізму
plt.plot([0,x1],[0,y1],'ko-')
plt.plot([x1,x2],[y1,y2],'ko-')
plt.show()